# Работа со списками

lst = ['🍇', '🍑', '🍐', '🍊', '🍌', '🍎']

# Выведите на экран первый и последний элементы.
print(lst[0] + " и " + lst[-1])
